#x = float(input('Введите число:  '))
#if(x < 0) : x = -x
#print(x)

#result = 7 > 6
#print(result)


#print('Я' > 'А' )
#print('Кот' > 'Код' )
#print('Сонный' > 'Сон' )

#Определение числа

#x = int(input('Введите число: '))
#if x < 0 : print("x отрицательное число")
#if x >= 0 : print("x положительное число")

#Улучшеная версия

#x = int(input('Введите число: '))
#if x < 0 :
    #print("x отрицательное число")
#else:
    #print("x положительное число")

    
#Добавлены проверка

x = int(input('Введите число: '))
if x < 0 :
    print("x отрицательное число")
elif x > 0:
    print("x положительное число")
else:
    print("x равен 0")
